* 출처 : https://dandyrilla.github.io/2017-08-12/pandas-10min/#2-%EB%8D%B0%EC%9D%B4%ED%84%B0-%ED%99%95%EC%9D%B8%ED%95%98%EA%B8%B0-viewing-data

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [3]:
s=pd.Series([1,3,5,np.nan,6,8])

In [4]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [5]:
dates=pd.date_range('20130101',periods=6)

In [6]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [7]:
df=pd.DataFrame(np.random.randn(6,4),index=dates,columns=list('ABCD'))

In [8]:
df

                   A         B         C         D
2013-01-01 -1.572439  0.009516  2.011169 -0.639448
2013-01-02  0.719506 -0.221816  0.587376 -0.048350
2013-01-03  1.915993 -0.569563  1.621676 -0.270662
2013-01-04  0.067218 -0.788585  0.175880  0.536635
2013-01-05 -1.480928  0.027317 -0.188838 -0.205934
2013-01-06 -0.369812  0.498277 -0.945503 -0.960359

In [9]:
df2 = pd.DataFrame({'A': 1.,
                    'B': pd.Timestamp('20130102'),
                    'C': pd.Series(1, index=list(range(4)), dtype='float32'),
                    'D': np.array([3]*4, dtype='int32'),
                    'E': pd.Categorical(['test', 'train', 'test', 'train']),
                    'F': 'foo'})

In [10]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [12]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [13]:
df.head()

                   A         B         C         D
2013-01-01 -1.572439  0.009516  2.011169 -0.639448
2013-01-02  0.719506 -0.221816  0.587376 -0.048350
2013-01-03  1.915993 -0.569563  1.621676 -0.270662
2013-01-04  0.067218 -0.788585  0.175880  0.536635
2013-01-05 -1.480928  0.027317 -0.188838 -0.205934

In [14]:
df.tail(3)

                   A         B         C         D
2013-01-04  0.067218 -0.788585  0.175880  0.536635
2013-01-05 -1.480928  0.027317 -0.188838 -0.205934
2013-01-06 -0.369812  0.498277 -0.945503 -0.960359

In [15]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [16]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [17]:
df2.index

Int64Index([0, 1, 2, 3], dtype='int64')

In [18]:
df2.columns

Index(['A', 'B', 'C', 'D', 'E', 'F'], dtype='object')

In [19]:
df.values

array([[-1.57243882,  0.00951616,  2.01116903, -0.63944789],
       [ 0.71950569, -0.22181604,  0.58737578, -0.04834968],
       [ 1.91599277, -0.56956341,  1.62167584, -0.27066166],
       [ 0.0672183 , -0.78858548,  0.17588045,  0.53663493],
       [-1.48092754,  0.02731691, -0.18883808, -0.20593368],
       [-0.36981242,  0.49827682, -0.94550334, -0.96035903]])

In [20]:
df2.values

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

In [21]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.120077 -0.174143  0.543627 -0.264686
std    1.334855  0.461006  1.114184  0.513188
min   -1.572439 -0.788585 -0.945503 -0.960359
25%   -1.203149 -0.482627 -0.097658 -0.547251
50%   -0.151297 -0.106150  0.381628 -0.238298
75%    0.556434  0.022867  1.363101 -0.087746
max    1.915993  0.498277  2.011169  0.536635

In [22]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -1.572439    0.719506    1.915993    0.067218   -1.480928   -0.369812
B    0.009516   -0.221816   -0.569563   -0.788585    0.027317    0.498277
C    2.011169    0.587376    1.621676    0.175880   -0.188838   -0.945503
D   -0.639448   -0.048350   -0.270662    0.536635   -0.205934   -0.960359

In [23]:
df

                   A         B         C         D
2013-01-01 -1.572439  0.009516  2.011169 -0.639448
2013-01-02  0.719506 -0.221816  0.587376 -0.048350
2013-01-03  1.915993 -0.569563  1.621676 -0.270662
2013-01-04  0.067218 -0.788585  0.175880  0.536635
2013-01-05 -1.480928  0.027317 -0.188838 -0.205934
2013-01-06 -0.369812  0.498277 -0.945503 -0.960359

In [25]:
df.sort_index(axis=1,ascending=False)

                   D         C         B         A
2013-01-01 -0.639448  2.011169  0.009516 -1.572439
2013-01-02 -0.048350  0.587376 -0.221816  0.719506
2013-01-03 -0.270662  1.621676 -0.569563  1.915993
2013-01-04  0.536635  0.175880 -0.788585  0.067218
2013-01-05 -0.205934 -0.188838  0.027317 -1.480928
2013-01-06 -0.960359 -0.945503  0.498277 -0.369812

In [27]:
df.sort_index(axis=0,ascending=False)

                   A         B         C         D
2013-01-06 -0.369812  0.498277 -0.945503 -0.960359
2013-01-05 -1.480928  0.027317 -0.188838 -0.205934
2013-01-04  0.067218 -0.788585  0.175880  0.536635
2013-01-03  1.915993 -0.569563  1.621676 -0.270662
2013-01-02  0.719506 -0.221816  0.587376 -0.048350
2013-01-01 -1.572439  0.009516  2.011169 -0.639448

In [30]:
df.sort_values(by='B',ascending=True)

                   A         B         C         D
2013-01-04  0.067218 -0.788585  0.175880  0.536635
2013-01-03  1.915993 -0.569563  1.621676 -0.270662
2013-01-02  0.719506 -0.221816  0.587376 -0.048350
2013-01-01 -1.572439  0.009516  2.011169 -0.639448
2013-01-05 -1.480928  0.027317 -0.188838 -0.205934
2013-01-06 -0.369812  0.498277 -0.945503 -0.960359

In [31]:
df

                   A         B         C         D
2013-01-01 -1.572439  0.009516  2.011169 -0.639448
2013-01-02  0.719506 -0.221816  0.587376 -0.048350
2013-01-03  1.915993 -0.569563  1.621676 -0.270662
2013-01-04  0.067218 -0.788585  0.175880  0.536635
2013-01-05 -1.480928  0.027317 -0.188838 -0.205934
2013-01-06 -0.369812  0.498277 -0.945503 -0.960359

In [32]:
df['A']

2013-01-01   -1.572439
2013-01-02    0.719506
2013-01-03    1.915993
2013-01-04    0.067218
2013-01-05   -1.480928
2013-01-06   -0.369812
Freq: D, Name: A, dtype: float64

In [33]:
df.A

2013-01-01   -1.572439
2013-01-02    0.719506
2013-01-03    1.915993
2013-01-04    0.067218
2013-01-05   -1.480928
2013-01-06   -0.369812
Freq: D, Name: A, dtype: float64

In [34]:
type(df['A'])

pandas.core.series.Series

In [35]:
df[0:3]

                   A         B         C         D
2013-01-01 -1.572439  0.009516  2.011169 -0.639448
2013-01-02  0.719506 -0.221816  0.587376 -0.048350
2013-01-03  1.915993 -0.569563  1.621676 -0.270662

In [36]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02  0.719506 -0.221816  0.587376 -0.048350
2013-01-03  1.915993 -0.569563  1.621676 -0.270662
2013-01-04  0.067218 -0.788585  0.175880  0.536635

In [37]:
df['20130102':'20130102']

                   A         B         C        D
2013-01-02  0.719506 -0.221816  0.587376 -0.04835

In [38]:
df.loc[:,['A','B']]

                   A         B
2013-01-01 -1.572439  0.009516
2013-01-02  0.719506 -0.221816
2013-01-03  1.915993 -0.569563
2013-01-04  0.067218 -0.788585
2013-01-05 -1.480928  0.027317
2013-01-06 -0.369812  0.498277

In [39]:
df.loc['20130102':'20130104',['A','B']]

                   A         B
2013-01-02  0.719506 -0.221816
2013-01-03  1.915993 -0.569563
2013-01-04  0.067218 -0.788585

In [40]:
df.loc[dates[0],'A']

-1.572438824573342

In [41]:
df.at[dates[0],'A']

-1.572438824573342

In [42]:
df.iloc[3]

A    0.067218
B   -0.788585
C    0.175880
D    0.536635
Name: 2013-01-04 00:00:00, dtype: float64

In [43]:
df.iloc[3:5,0:2]

                   A         B
2013-01-04  0.067218 -0.788585
2013-01-05 -1.480928  0.027317

In [45]:
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02  0.719506  0.587376
2013-01-03  1.915993  1.621676
2013-01-05 -1.480928 -0.188838

In [46]:
df.iloc[1:3,:]

                   A         B         C         D
2013-01-02  0.719506 -0.221816  0.587376 -0.048350
2013-01-03  1.915993 -0.569563  1.621676 -0.270662

In [47]:
df.iloc[:,1:3]

                   B         C
2013-01-01  0.009516  2.011169
2013-01-02 -0.221816  0.587376
2013-01-03 -0.569563  1.621676
2013-01-04 -0.788585  0.175880
2013-01-05  0.027317 -0.188838
2013-01-06  0.498277 -0.945503

In [48]:
df[df.A>0]

                   A         B         C         D
2013-01-02  0.719506 -0.221816  0.587376 -0.048350
2013-01-03  1.915993 -0.569563  1.621676 -0.270662
2013-01-04  0.067218 -0.788585  0.175880  0.536635

In [49]:
df[df.B>0]

                   A         B         C         D
2013-01-01 -1.572439  0.009516  2.011169 -0.639448
2013-01-05 -1.480928  0.027317 -0.188838 -0.205934
2013-01-06 -0.369812  0.498277 -0.945503 -0.960359

In [50]:
df[df>0]

                   A         B         C         D
2013-01-01       NaN  0.009516  2.011169       NaN
2013-01-02  0.719506       NaN  0.587376       NaN
2013-01-03  1.915993       NaN  1.621676       NaN
2013-01-04  0.067218       NaN  0.175880  0.536635
2013-01-05       NaN  0.027317       NaN       NaN
2013-01-06       NaN  0.498277       NaN       NaN

In [51]:
df2=df.copy()

In [52]:
df2

                   A         B         C         D
2013-01-01 -1.572439  0.009516  2.011169 -0.639448
2013-01-02  0.719506 -0.221816  0.587376 -0.048350
2013-01-03  1.915993 -0.569563  1.621676 -0.270662
2013-01-04  0.067218 -0.788585  0.175880  0.536635
2013-01-05 -1.480928  0.027317 -0.188838 -0.205934
2013-01-06 -0.369812  0.498277 -0.945503 -0.960359

In [53]:
df2['E']=['one','one','two','three','four','three']

In [54]:
df2

                   A         B         C         D      E
2013-01-01 -1.572439  0.009516  2.011169 -0.639448    one
2013-01-02  0.719506 -0.221816  0.587376 -0.048350    one
2013-01-03  1.915993 -0.569563  1.621676 -0.270662    two
2013-01-04  0.067218 -0.788585  0.175880  0.536635  three
2013-01-05 -1.480928  0.027317 -0.188838 -0.205934   four
2013-01-06 -0.369812  0.498277 -0.945503 -0.960359  three

In [55]:
df2[df2['E'].isin(['two','four'])]

                   A         B         C         D     E
2013-01-03  1.915993 -0.569563  1.621676 -0.270662   two
2013-01-05 -1.480928  0.027317 -0.188838 -0.205934  four

In [56]:
s1=pd.Series([1,2,3,4,5,6],index=pd.date_range('20130102',periods=6))

In [57]:
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [58]:
df['F']=s1

In [59]:
df

                   A         B         C         D    F
2013-01-01 -1.572439  0.009516  2.011169 -0.639448  NaN
2013-01-02  0.719506 -0.221816  0.587376 -0.048350  1.0
2013-01-03  1.915993 -0.569563  1.621676 -0.270662  2.0
2013-01-04  0.067218 -0.788585  0.175880  0.536635  3.0
2013-01-05 -1.480928  0.027317 -0.188838 -0.205934  4.0
2013-01-06 -0.369812  0.498277 -0.945503 -0.960359  5.0

In [60]:
df.at[dates[0],'A']=0

In [61]:
df.iat[0,1]=0

In [62]:
df

                   A         B         C         D    F
2013-01-01  0.000000  0.000000  2.011169 -0.639448  NaN
2013-01-02  0.719506 -0.221816  0.587376 -0.048350  1.0
2013-01-03  1.915993 -0.569563  1.621676 -0.270662  2.0
2013-01-04  0.067218 -0.788585  0.175880  0.536635  3.0
2013-01-05 -1.480928  0.027317 -0.188838 -0.205934  4.0
2013-01-06 -0.369812  0.498277 -0.945503 -0.960359  5.0

In [63]:
df.loc(:,'D')=np.array([5]*len(df))

SyntaxError: invalid syntax (<ipython-input-63-2bbcfefee639>, line 1)

In [64]:
df.loc[:,'D']=np.array([5]*len(df))

In [65]:
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000  2.011169  5  NaN
2013-01-02  0.719506 -0.221816  0.587376  5  1.0
2013-01-03  1.915993 -0.569563  1.621676  5  2.0
2013-01-04  0.067218 -0.788585  0.175880  5  3.0
2013-01-05 -1.480928  0.027317 -0.188838  5  4.0
2013-01-06 -0.369812  0.498277 -0.945503  5  5.0

In [66]:
df2=df.copy()

In [67]:
df2

                   A         B         C  D    F
2013-01-01  0.000000  0.000000  2.011169  5  NaN
2013-01-02  0.719506 -0.221816  0.587376  5  1.0
2013-01-03  1.915993 -0.569563  1.621676  5  2.0
2013-01-04  0.067218 -0.788585  0.175880  5  3.0
2013-01-05 -1.480928  0.027317 -0.188838  5  4.0
2013-01-06 -0.369812  0.498277 -0.945503  5  5.0

In [68]:
df2[df2>0]=-df2

In [69]:
df2

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -2.011169 -5  NaN
2013-01-02 -0.719506 -0.221816 -0.587376 -5 -1.0
2013-01-03 -1.915993 -0.569563 -1.621676 -5 -2.0
2013-01-04 -0.067218 -0.788585 -0.175880 -5 -3.0
2013-01-05 -1.480928 -0.027317 -0.188838 -5 -4.0
2013-01-06 -0.369812 -0.498277 -0.945503 -5 -5.0

In [70]:
df1=df.reindex(index=dates[0:4],columns=list(df.columns)+['E'])

In [71]:
df1

                   A         B         C  D    F   E
2013-01-01  0.000000  0.000000  2.011169  5  NaN NaN
2013-01-02  0.719506 -0.221816  0.587376  5  1.0 NaN
2013-01-03  1.915993 -0.569563  1.621676  5  2.0 NaN
2013-01-04  0.067218 -0.788585  0.175880  5  3.0 NaN

In [72]:
df1.at[dates[0:2],'E']=1

In [74]:
df1.at[dates[0]:dates[1],'E']=1

In [75]:
df1.dropna(how='any')

                   A         B         C  D    F    E
2013-01-02  0.719506 -0.221816  0.587376  5  1.0  1.0

In [76]:
df1

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000  2.011169  5  NaN  1.0
2013-01-02  0.719506 -0.221816  0.587376  5  1.0  1.0
2013-01-03  1.915993 -0.569563  1.621676  5  2.0  NaN
2013-01-04  0.067218 -0.788585  0.175880  5  3.0  NaN

In [77]:
df1.fillna(value=5)

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000  2.011169  5  5.0  1.0
2013-01-02  0.719506 -0.221816  0.587376  5  1.0  1.0
2013-01-03  1.915993 -0.569563  1.621676  5  2.0  5.0
2013-01-04  0.067218 -0.788585  0.175880  5  3.0  5.0

In [78]:
df1

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000  2.011169  5  NaN  1.0
2013-01-02  0.719506 -0.221816  0.587376  5  1.0  1.0
2013-01-03  1.915993 -0.569563  1.621676  5  2.0  NaN
2013-01-04  0.067218 -0.788585  0.175880  5  3.0  NaN

In [79]:
pd.isna(df1)

                A      B      C      D      F      E
2013-01-01  False  False  False  False   True  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False   True
2013-01-04  False  False  False  False  False   True

In [81]:
df.mean()

A    0.141996
B   -0.175729
C    0.543627
D    5.000000
F    3.000000
dtype: float64

In [82]:
df.mean(1)

2013-01-01    1.752792
2013-01-02    1.417013
2013-01-03    1.993621
2013-01-04    1.490903
2013-01-05    1.471510
2013-01-06    1.836592
Freq: D, dtype: float64

In [83]:
s=pd.Series([1,3,5,np.nan,6,8])

In [89]:
s=pd.Series([1,3,5,np.nan,6,8],index=dates).shift(2)

In [92]:
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [93]:
df.sub(s,axis='index')

                   A         B         C    D    F
2013-01-01       NaN       NaN       NaN  NaN  NaN
2013-01-02       NaN       NaN       NaN  NaN  NaN
2013-01-03  0.915993 -1.569563  0.621676  4.0  1.0
2013-01-04 -2.932782 -3.788585 -2.824120  2.0  0.0
2013-01-05 -6.480928 -4.972683 -5.188838  0.0 -1.0
2013-01-06       NaN       NaN       NaN  NaN  NaN

* index를 기준으로 series s의 데이터로 뺄셈.

In [94]:
df.apply(np.cumsum)

                   A         B         C   D     F
2013-01-01  0.000000  0.000000  2.011169   5   NaN
2013-01-02  0.719506 -0.221816  2.598545  10   1.0
2013-01-03  2.635498 -0.791379  4.220221  15   3.0
2013-01-04  2.702717 -1.579965  4.396101  20   6.0
2013-01-05  1.221789 -1.552648  4.207263  25  10.0
2013-01-06  0.851977 -1.054371  3.261760  30  15.0

In [95]:
df.apply(lambda x: x.max() - x.min())

A    3.396920
B    1.286862
C    2.956672
D    0.000000
F    4.000000
dtype: float64

* 데이터 프레임에 함수를 적용할 수 있다.
* 기존에 존재하는 함수를 사용하거나, 사용자가 정의한 람다함수를 사용 할 수도 있습니다.

# 히스토그램 구하기(Histogramming)

## 데이터의 값들의 빈도를 조사하여 히스토그램을 만들 수 있습니다.

In [96]:
s=pd.Series(np.random.randint(0,7,size=10))

In [97]:
s

0    6
1    3
2    4
3    5
4    2
5    3
6    3
7    4
8    6
9    6
dtype: int32

In [98]:
s.value_counts()

6    3
3    3
4    2
5    1
2    1
dtype: int64

* 각 데이터 값들의 빈도를 보여줌

# 문자열 관련 메소드들(String methods)

### 아래의 예제처럼 시리즈(Series)는 배열의 각 요소에 쉽게 적용이 가능하도록 str 이라는 속성에 문자열을 처리할 수 있는 여러가지의 메소드들을 갖추고 있습니다. 문자열 내에서의 패턴을 찾기 위한 작업들은 일반적으로 기본적으로 정규표현식을 사용하는 것에 유의합니다. (몇몇의 경우에는 항상 정규표현식을 사용합니다.)

In [99]:
s=pd.Series(['A','B','C','Aaba','Baca',np.nan,'CABA','dog','cat'])

In [100]:
s

0       A
1       B
2       C
3    Aaba
4    Baca
5     NaN
6    CABA
7     dog
8     cat
dtype: object

In [101]:
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

# 6.합치기(Merging)

### 다양한 정보를 담은 자료들이 있을 때 이들을 합쳐 새로운 자료를 만들어야 할 때가 있습니다. 이번에는 시리즈(Series) 또는 데이터프레임(DataFrame)을 어떻게 합치는지를 알아볼 것입니다. 같은 형태의 자료들을 이어 하나로 만들어주는 concat, 다른 형태의 자료들을 한 컬럼을 기준으로 합치는 merge, 기존 데이터 프레임에 하나의 행을 추가하는 append 의 사용법에 대해 알아봅니다.

# Concat

In [110]:
df=pd.DataFrame(np.random.randn(10,4))

In [111]:
df

          0         1         2         3
0  2.701336 -0.112860 -0.526535  0.603464
1 -1.580273 -1.136680 -0.708745  0.376771
2 -1.369894  0.020729 -0.706967  1.971121
3 -1.038777 -0.143040 -0.327802  1.456022
4  0.832122 -1.437705 -1.253492 -0.672541
5 -1.342581  0.776536 -0.326812  0.875499
6  1.276919 -1.130592 -0.591607 -0.483995
7 -1.568850 -0.433367 -0.990018 -2.147605
8 -2.561756  0.603111  1.389224 -0.031546
9  1.635937  2.331269 -1.152793  0.641428

In [112]:
pieces=[df[:3],df[3:7],df[7:]]

In [113]:
pieces

[          0         1         2         3
 0  2.701336 -0.112860 -0.526535  0.603464
 1 -1.580273 -1.136680 -0.708745  0.376771
 2 -1.369894  0.020729 -0.706967  1.971121,
           0         1         2         3
 3 -1.038777 -0.143040 -0.327802  1.456022
 4  0.832122 -1.437705 -1.253492 -0.672541
 5 -1.342581  0.776536 -0.326812  0.875499
 6  1.276919 -1.130592 -0.591607 -0.483995,
           0         1         2         3
 7 -1.568850 -0.433367 -0.990018 -2.147605
 8 -2.561756  0.603111  1.389224 -0.031546
 9  1.635937  2.331269 -1.152793  0.641428]

In [114]:
pd.concat(pieces)

          0         1         2         3
0  2.701336 -0.112860 -0.526535  0.603464
1 -1.580273 -1.136680 -0.708745  0.376771
2 -1.369894  0.020729 -0.706967  1.971121
3 -1.038777 -0.143040 -0.327802  1.456022
4  0.832122 -1.437705 -1.253492 -0.672541
5 -1.342581  0.776536 -0.326812  0.875499
6  1.276919 -1.130592 -0.591607 -0.483995
7 -1.568850 -0.433367 -0.990018 -2.147605
8 -2.561756  0.603111  1.389224 -0.031546
9  1.635937  2.331269 -1.152793  0.641428

# Join

### 데이터 베이스에서 사용하는 SQL스타일의 합치기 기능. merge 메소드를 통해 이루어진다.

In [115]:
left=pd.DataFrame({'key':['foo','foo'], 'lval':[1,2]})

In [116]:
left

   key  lval
0  foo     1
1  foo     2

In [117]:
right=pd.DataFrame({'key':['foo','foo'],'rval':[4,5]})

In [118]:
right

   key  rval
0  foo     4
1  foo     5

In [119]:
merged=pd.merge(left,right,on='key')

In [120]:
merged

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

* key값을 중복으로 가질 때, 모든 경우의 수를 만들어낸다.

In [121]:
left=pd.DataFrame({'key':['foo','bar'],'lval':[1,2]})

In [122]:
left

   key  lval
0  foo     1
1  bar     2

In [123]:
right=pd.DataFrame({'key':['foo','bar'],'rval':[4,5]})

In [124]:
right

   key  rval
0  foo     4
1  bar     5

In [125]:
merged=pd.merge(left,right,on='key')

In [126]:
merged

   key  lval  rval
0  foo     1     4
1  bar     2     5

* on='key'에 의해서, 같은 key값에 대해서, 가능한 val의 조합을 만든다.

In [128]:
merged=pd.merge(right,left,on='key')

In [129]:
merged

   key  rval  lval
0  foo     4     1
1  bar     5     2

* 그냥 해본거,  순서바꾸면 어떻게 될까?

# Append

### 데이터프레임의 맨 뒤에 행을 추가합니다. 아래의 예제는 4번째 행을 기존의 데이터프레임의 맨 뒤에 한번 더 추가하는 방법을 보여주고 있습니다.

In [130]:
df=pd.DataFrame(np.random.randn(8,4),columns=['A','B','C','D'])

In [131]:
df

          A         B         C         D
0 -0.541297 -1.805373  0.434362  1.060119
1  0.824388 -0.219188 -1.040364  1.381207
2 -0.098250 -1.597163  1.084092  1.782099
3  0.348626  1.025057  1.041912  1.709728
4 -0.638333 -0.798161 -0.194590  0.676393
5  1.012562  1.294428  1.429184 -1.856730
6  1.454944 -1.307022  0.248512 -1.862922
7  0.254522  1.368266  0.077065 -0.647592

In [132]:
s=df.iloc[3]

* df의 index=3인 행, 즉 네 번째 행을 반환

In [133]:
s

A    0.348626
B    1.025057
C    1.041912
D    1.709728
Name: 3, dtype: float64

In [134]:
df.append(s,ignore_index=True)

          A         B         C         D
0 -0.541297 -1.805373  0.434362  1.060119
1  0.824388 -0.219188 -1.040364  1.381207
2 -0.098250 -1.597163  1.084092  1.782099
3  0.348626  1.025057  1.041912  1.709728
4 -0.638333 -0.798161 -0.194590  0.676393
5  1.012562  1.294428  1.429184 -1.856730
6  1.454944 -1.307022  0.248512 -1.862922
7  0.254522  1.368266  0.077065 -0.647592
8  0.348626  1.025057  1.041912  1.709728

# 7. 묶기(Grouping)

### '그룹화(group by)'는 다음과 같은 처리를 하는 과정들을 지칭합니다.

* 어떠한 기준을 바탕으로 데이터를 나누는 일(splitting)
* 각 그룹에 어떤 함수를 독립적으로 적용시키는 일(appying)
* 적용되어 나온 결과들을 통합하는 일(combining)